[
  {
    "title": "Portland Weekend Brunch Finder",
    "url": "https://gnkatchmar.github.io/Code201Final",
    "lastMod": "2016-08",
    "body": "<p>Code Fellows 201 Final Project.<img src='images/201Final01.jpg' class='pull-left'></p><p>I pitched the idea of using my preexisting spreadsheet of Portland brunch locations as the basis for a class final project. It was voted 'most popular' of the three projects and four other classmates signed on to make it happen.</p>First, the spreadsheet was built out, adding urls, latitude, longitude, and later, Google Place IDs. Using concatenation, the spreadsheet was then used to build the data array of 100+ restaurants (and later, a pulldown menu).</p><p><img src='images/201Final02.jpg' class='pull-right'>For the Home page, Google Places API was used to access restaurant-specific images to great effect where three random restaurants are displayed. A geolocation option was also added, thus narrowing the restaurants displayed to those closest to the user.</p><p>For the Search page, Google Maps API was incorporated to display restaurants based on the user input for neighborhoods and desired time (only restuarants open at that time are displayed). Using the same user input, a text display of the pertinent restaurants was also added.</p><p>To meet assignment requirements, a 'mini-Yelp' Review page was added that used local storage to somewhat mimic a database backend for the application.</p><p>After some discussion, the group decided upon a 'sophisticated' appearance over a 'whimsical' approach which would have featured bacon-shaped buttons, bearded hipster servers, etc.</p>"
  },
    {
    "title": "Treehouse Achievement Badges",
    "url": "http://www.gkatchmar.com/Gregory%20Katchmar.html",
    "lastMod": "2016-02",
    "body": "<p>From February 2015 through February 2016, I participated in the Code Oregon 1.0/Treehouse program. </p><img src='images/Badges01.jpg' class='pull-left'>Per their website, 'As you progress through Tracks and the Library, you'll earn points for completing videos and quizzes and earn badges for bigger accomplishments. Show off your badges on your own sites and apps!'<img src='images/Badges02.jpg' class='pull-right'></p><p>I earned 10,906 points and 128 badges in JavaScript, Development Tools, HTML, PHP, CSS and Python (in order of points awarded).</p>"
  },
  {
    "title": "Visual Basic for Applications (VBA) Macros for Large Law Firm",
    "url": "",
    "lastMod": "2012-04",
    "body": "<p>From March 1999 until April 2012, I worked as the Software Specialist for the Information Processing Center at Stoel Rives LLP, the largest law firm in Oregon.</p><img src='images/Stoel01.jpg' class='pull-left'> <img src='images/Stoel02.jpg' class='pull-right'>During most of that time, I was solely responsible for using self-taught VBA to program macros to meet the needs of this multistate firm. Some of these macros included Excel Print Setup, Word Document Cleaners, and Workshare Compare Reversal. </p><p>Moreover, I was also responsible for managing the MacPac for Legal template system which required making revisions to the underlying Microsoft Access database in addition to creation and modification of the associated Microsoft Word boilerplate components.</p>"
  }
]
